CSI API ETABS v1

# cLineElmGetPoints Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPoints(
    	string Name,
    	ref string Point1,
    	ref string Point2
    )

    Function GetPoints (
    	Name As String,
    	ByRef Point1 As String,
    	ByRef Point2 As String
    ) As Integer

    Dim instance As cLineElm
    Dim Name As String
    Dim Point1 As String
    Dim Point2 As String
    Dim returnValue As Integer

    returnValue = instance.GetPoints(Name,
    	Point1, Point2)

    int GetPoints(
    	String^ Name,
    	String^% Point1,
    	String^% Point2
    )

    abstract GetPoints :
            Name : string *
            Point1 : string byref *
            Point2 : string byref -> int

#### Parameters

Name

    Type: SystemString

Point1

    Type: SystemString

Point2

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cLineElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com